[
  {
    "path": "posts/2021-07-18-makeover-3/",
    "title": "DataViz Makeover 3",
    "description": "DataViz Makeover 3 for ISSS608: Visual Analytics.",
    "author": [
      {
        "name": "Qian Ziwei",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualization1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualization\r\n4.0 Step-by-Step Guide\r\n\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\nThe first graph:\r\n\r\nThe second graph:\r\n\r\n1.1 Clarity\r\nThe title of the graph does not convey the intent of the graph well.\r\nThe first graph:\r\nThe title indicates the content of the chart is top five districts with the highest number of cumulative deaths, but in fact the chart presents the number of cumulative deaths in all 44 cities.\r\nThese areas in the graph are better to called cities, not districts.\r\nThe second graph:\r\nThe areas in the second graphs are better to called districts.\r\nBoth two graphs\r\nThere should be a connection between the two graphs.\r\nThe content of the graph\r\nThe first graph: data\r\nMaps for charts with geographical information is more appropriate.\r\nIt is difficult for readers to get useful information from the graph. Cannot compare the data of each city well.\r\nThe first graph: annotate\r\nAlthough the graph is marked name of top five cities, it does not show the exact number of deaths in the five cities.\r\n1.2 Aesthetic\r\nThe first graph:\r\nOn the y-axis are the names of 44 cities, which are too complicated.\r\nComments are too focused and don’t provide useful information.\r\nThe choice to use dots as shape leaves too much white space throughout the chart.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nThe first graph:\r\nUse the appropriate chart type. Use the map as the graph background and add dots of the cities cumulative deaths on the map.\r\nChange the title of the graph: “Cities with the number of cumulative deaths at 30th June 2021, DKI Jakarta”.\r\nSet the number of cumulative deaths as the color and size of circles in the graph to help readers to compare the cumulative deaths of cities.\r\nAdd the districts of DKI Jakarta as the filter, so we can compare the difference cumulative deaths of different districts. And also connect to the second graph.\r\nUse the number of cities cumulative deaths and names of cities as the label to help readers compare.\r\nThe second graph:\r\nChange the title of the graph: “Average number of cumulative positive cases per district at 30th June 2021, DKI Jakarta”.\r\n2.2 Aesthetic\r\nThe first graph:\r\nUse the appropriate chart type. Use the map as the graph background and add dots of the cities cumulative deaths on the map. It will be easy to read.\r\nSet the number of cumulative deaths as the color and size of circles. Don’t leave too much space in the graph.\r\nUse the number of cities cumulative deaths and names of cities as the label.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-Step Guide\r\nNo\r\nStep\r\nAction\r\n1\r\nDownload the Standar Kelurahan Data Corona (30 Juni 2021 Pukul 10.00) from the Open Data Covid-19 Provinsi DKI Jakarta website. Load the excel file into Tableau Prep Builder. Drag the ‘data_kacamatan’ into main pane.\r\n\r\n2\r\nInitiate the cleaning node from ‘data_kacamatan’ data node.\r\n\r\n3\r\nUnder the ‘Clean 1’ node,remove useless variables.\r\n\r\n4\r\nUnder ‘Clean 1’ node, filter the rows under ‘Nama_provinsi’ to choose ‘DKI Jakarta’.\r\n\r\n5\r\nCreate a ‘Output’ node after ‘Clean 1’ node and save output as ‘Output’.\r\n\r\n6\r\nImport the data into Tableau.\r\n\r\n7\r\nFor chart 1, give the graph title called ‘Cities with the number of cumulative deaths at 30th June 2021, DKI Jakarta’.\r\n\r\n8\r\nDrag ‘Longitude(generated)’ to “Columns” and ‘Latitude(generated)’ to “Rows”.\r\n\r\n9\r\nSet the “Nama Kota” variable role as “State/Province”.\r\n\r\n10\r\nSet the “Nama Kecamatan” variable role as “City”.\r\n\r\n11\r\nDrag “Nama Kecamatan” which is the name of cities as a layer.\r\n\r\n12\r\nEdit map location.\r\n\r\n13\r\nUnder the map location pane, choose the country as “Indonesia”.\r\n\r\n14\r\nBecause the names of cities in the dataset can not match the names in the Tableau. So enter the longitude and latitude to each city.\r\n\r\n15\r\nUnder Mark pane, drag ‘Meninggal’ which means deaths number to Color, Size and Label.\r\n\r\n16\r\nUnder Mark pane, drag ‘Nama kecamatan’ which means cities’ names to Label and Tooltip.\r\n\r\n17\r\nUnder Mark pane, choose the circle shape.\r\n\r\n18\r\nDrag “Nama Kota” which is the name of districts  as a layer.\r\n\r\n19\r\nUnder Mark pane, drag ‘Nama Kota’ which means districts’ names to Color.\r\n\r\n20\r\nDrag ‘Nama Kota’ which means districts’ names to Filter.\r\n\r\n21\r\nChoose “Show filter”.\r\n\r\n22\r\nChoose “Single Value”.\r\n\r\n23\r\nDrag ‘Meninggal’ which means deaths number to Filter.\r\n\r\n24\r\nChoose “Show filter”.\r\n\r\n25\r\nFor chart 2, give the graph title called ‘Average number of cumulative positive cases per district at 30th June 2021, DKI Jakarta.’.\r\n\r\n26\r\nDrag ‘Positif’ which means the positive cases to “Columns” and ‘Nama Kota’ to “Rows”.\r\n\r\n27\r\nDrag ‘Nama Kota’ which means districts’ names to Filter.\r\n\r\n28\r\nChoose “Show filter”.\r\n\r\n29\r\nChoose “Single Value”.\r\n\r\n30\r\nCreate a new dashboard to combine these two graphs.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-19T00:44:56+08:00",
    "input_file": "makeover-3.knit.md"
  }
]
