[
  {
    "path": "posts/2021-07-18-makeover-3/",
    "title": "DataViz Makeover 3",
    "description": "DataViz Makeover 3 for ISSS608: Visual Analytics.",
    "author": [
      {
        "name": "Qian Ziwei",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-10",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualization1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Visualization\r\n4.0 Step-by-Step Guide\r\n\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nThe title of the graph does not convey the intent of the graph well.\r\nThe first graph\r\nThe title indicates the content of the chart is top five districts with the hightest number of cumulative deaths, but in fact the chart presents the number of cumulative deaths in all 44 cities.\r\nThese areas in the graph are better to called cities, not districts.\r\n\r\nThe second graph\r\nThe areas in the second graphs are better to called stricts.\r\n\r\n\r\nThe content of the graph\r\nThe first graph: data\r\nMaps for charts with geographical information is more appropriate.\r\nIt is difficult for readers to get useful information from the graph. Cannot compare the data of each city well.\r\n\r\nThe first graph: annotate\r\nAlthough the graph is marked name of top five cities, it does not show the exact number of deaths in the five cities.\r\n\r\n\r\n1.2 Aesthetic\r\n+ The first graph: data\r\n\r\n1.On the y-axis are the names of 44 cities, which are too complicated.\r\n\r\n2.Comments are too focused and don't provide useful information.\r\n\r\n3.The choice to use dots as shape leaves too much white space throughout the chart.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nUse ‘Title’ and ‘Subtitle’ to tell readers the objectives of different graphs in the dashboard.\r\nAdd note under the graph to indicate the unit of the number.\r\n2.2 Aesthetic\r\nUse simple color ‘Red’ and ‘Blue’ to indicate the difference of types. It will be easy to read.\r\nRemove the unnecessary icons in the graphs.\r\nAdd useful information in “Tooltip”.\r\nShow the range of the using data in the graph title.\r\nCreate a new graph called ‘Change of Net export value of  from 2011 to 2020’ to show the information in the original blue background annotate.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-Step Guide\r\nNo\r\nStep\r\nAction\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-18T15:40:22+08:00",
    "input_file": "makeover-3.knit.md"
  }
]
